import numpy as np
import matplotlib.pyplot as plt
from sklearn.manifold import TSNE

oomono_param = np.array([
    [1, 0.2, 0.3, 0, 0.1, 0.2, 0.1, 1, 0.2, 0.1, 1, 0.5, 1, 1],
    [0.9, 0.2, 1, 0.5, 0.1, 0.2, 0.5, 0.5, 1, 0.1, 0.3, 0, 0.7, 1],
    [0, 0, 1, 1, 0.1, 0.6, 0.3, 0.42, 0.5, 1, 0.2, 0, 0, 0.1],
    [0.5, 0.7, 0.2, 0.2, 0.8, 0.3, 0.3, 0.3, 0.3, 0.4, 1, 0, 0.3, 1],
    [0.5, 0.8, 0.2, 0.5, 0.2, 0.3, 0.8, 1, 0.3, 0.5, 0.2, 0, 0.5, 0.8],
    [0.7, 0.8, 1, 0.2, 0.1, 1, 0.3, 0.5, 1, 0.1, 0.5, 0, 0.7, 1],
    [0.7, 0.8, 0.2, 0, 0.6, 0, 0.8, 0.5, 0.4, 1, 1, 1, 0.5, 0.6],
    [0.4, 0.8, 0.3, 1, 0.1, 0.2, 0.2, 0.3, 0.5, 0.1, 1, 0, 1, 1],
    [0, 1, 1, 1, 1, 0.2, 0.7, 0.24, 1, 0.2, 0.1, 0, 0.5, 0.5],
    [0.1, 0, 0.8, 1, 0.1, 0.2, 1, 1, 0.3, 0.8, 0.3, 0, 0.2, 0.1],
    [0, 0, 1, 0.3, 1, 0.5, 0.5, 0.5, 0.6, 0.1, 1, 0, 0.1, 0.7]
], dtype=np.float32)

oomono_label = [
    "モグラ",
    "テッパン",
    "タワー",
    "バクダン",
    "コウモリ",
    "ヘビ",
    "カタパッド",
    "ダイバー",
    "ハシラ",
    "テッキュウ",
    "ナベブタ"
]

X_reduced = TSNE(n_components=2, perplexity=5, random_state=0).fit_transform(oomono_param)

plt.figure()
plt.scatter(X_reduced[:, 0], X_reduced[:, 1])
plt.axis("off")
plt.show()
